# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Keith\Desktop\PSOC_Mid.cydsn\PSOC_Mid.cyprj
# Date: Fri, 20 Apr 2018 14:51:22 GMT
#set_units -time ns
create_clock -name {SPIS_SCBCLK(FFB)} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {StripLights_HFCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 5} [list [get_pins {ClockBlock/udb_div_0}]]
create_generated_clock -name {SPIS_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 7} [list]


# Component constraints for C:\Users\Keith\Desktop\PSOC_Mid.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Keith\Desktop\PSOC_Mid.cydsn\PSOC_Mid.cyprj
# Date: Fri, 20 Apr 2018 14:51:17 GMT
